# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

num = int(input('введите трехзначное число: '))
a = num%10
num = num//10
b = num%10
c = num//10
print('сумма равна:', a + b + c)

